In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df1.shape

(7, 3)

In [12]:
print("No of Rows:",df1.shape[0])
print("No of Columns:",df1.shape[1])

No of Rows: 7
No of Columns: 3

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [17]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [20]:
df1.describe(include='all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Mittal        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

In [21]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [26]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [27]:
df1['Gender'].nunique()

2

In [29]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [31]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [35]:
len(df1[(df1['Marks']>=90) & ( df1['Marks']<=100)])

4

In [38]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [39]:
df1['Marks'].max()

99

In [40]:
df1['Marks'].min()

83

In [41]:
df1['Marks'].mean()

92.14285714285714

In [46]:
def marks(x):
    return x//2

In [47]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [48]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [49]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [51]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [52]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [55]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [56]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [63]:
df1.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [64]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [65]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [66]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [70]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female